# SetParameterDefaultValue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeDefinition..::..SetParameterDefaultValue Method
RebarShapeDefinition Class See Also
---
Change the parameter's value as stored in the definition.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public void SetParameterDefaultValue(
	ElementId paramId,
	double value
)
```

Visual Basic
---
```text
Public Sub SetParameterDefaultValue ( _
	paramId As ElementId, _
	value As Double _
)
```

Visual C++
---
```text
public:
void SetParameterDefaultValue(
	ElementId^ paramId,
	double value
)
```

# ### Parameters
paramId
    Type: Autodesk.Revit.DB..::..ElementId Id of a parameter in the definition.
value
    Type: System..::..Double New value for the parameter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | This RebarShapeDefinition does not have a value for the parameter paramId. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace